# Adopt apps that are already installed on disk instead of erroring —
# brew takes ownership of the existing copy when versions match.
cask_args adopt: true

brew "autojump"
brew "python3"
brew "bash-completion@2"
brew "bat"
brew "btop"
brew "buf"
brew "cheat"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "entr"
brew "eza"
brew "fd"
brew "figlet"
brew "fnm"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "openjdk"
brew "gradle"
brew "graphviz"
brew "grep"
brew "helm"
brew "highlight"
brew "htop"
brew "jabba"
brew "jq"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "kops"
brew "kubectx"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "markdown"
brew "mas"
brew "maven"
brew "minikube"
brew "protobuf"
brew "mosh"
brew "mutt"
brew "navi"
brew "neovim"
brew "nmap"
brew "nnn"
brew "node"
brew "noti"
brew "nvm"
brew "pandoc"
brew "pipenv"
brew "pkgconf"
brew "pnpm"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "rocksdb"
brew "shellcheck"
brew "skaffold"
brew "stern"
brew "tesseract"
brew "tailscale"
brew "thefuck"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "uv"
brew "watchman"
brew "wdiff"
brew "weechat"
brew "wget"
brew "wtf"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "antigravity-cli"
cask "antigravity-ide"
cask "basictex"
cask "docker-desktop"
cask "claude"
cask "claude-code"
cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "google-chrome"
cask "google-gemini"
cask "iterm2"
cask "little-snitch"
cask "logi-options+"
cask "okta-verify"
cask "raycast"
cask "setapp"
cask "slack"
cask "visual-studio-code"
mas "AdBlock", id: 1402042596
mas "Dark Reader for Safari", id: 1438243180
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"