tap "aws/tap"
tap "github/gh"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "schniz/tap"
tap "teamookla/speedtest"
tap "versent/taps"
brew "ack"
brew "autojump"
brew "awscli"
brew "bat"
brew "cheat"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "go"
brew "dep"
brew "diff-so-fancy"
brew "direnv"
brew "docker", link: false
brew "docker-completion", link: false
brew "entr"
brew "exa"
brew "fd"
brew "figlet"
brew "fnm"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitlab-runner"
brew "gnupg"
brew "golangci-lint"
brew "gradle"
brew "graphviz"
brew "grep"
brew "helm"
brew "helm@2"
brew "highlight"
brew "htop"
brew "hub"
brew "jabba"
brew "jq"
brew "k6"
brew "openjdk"
brew "kafka"
brew "kind"
brew "kubernetes-cli"
brew "kops"
brew "kubectx"
brew "kustomize"
brew "lastpass-cli"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "markdown"
brew "mas"
brew "maven"
brew "minikube"
brew "protobuf"
brew "mosh"
brew "mutt"
brew "navi"
brew "nmap"
brew "nnn"
brew "node"
brew "noti"
brew "nvm"
brew "openjdk@11"
brew "pipenv"
brew "postgresql@14"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rocksdb"
brew "shellcheck"
brew "skaffold"
brew "stern"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "weechat"
brew "wget"
brew "wtf"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "aws/tap/aws-sam-cli"
brew "teamookla/speedtest/speedtest"
cask "bettertouchtool"
cask "docker"
cask "drawio"
cask "dropbox"
cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "google-drive"
cask "graalvm-ce-java17"
cask "grammarly-desktop"
cask "iterm2"
cask "kaleidoscope"
cask "ksdiff"
cask "little-snitch"
cask "notion"
cask "raycast"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "whatsapp"
cask "yubico-yubikey-manager"
mas "Day One", id: 1055511498
mas "Final Cut Pro", id: 424389933
mas "Pastebot", id: 1179623856
mas "PDF Expert", id: 1055273043
mas "Reeder", id: 1529448980
mas "Things", id: 904280696
