tap "antoniorodr/memo"
tap "aws/tap"
tap "github/gh"
tap "graalvm/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "microsoft/git"
tap "schniz/tap"
tap "steipete/tap"
tap "teamookla/speedtest"
tap "versent/taps"
brew "ack"
brew "autojump"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "buf"
brew "cheat"
brew "cloc"
brew "cmake"
brew "cmatrix"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "entr"
brew "exa"
brew "fd"
brew "figlet"
brew "fnm"
brew "gawk"
brew "gcc"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitlab-runner"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "openjdk"
brew "gradle"
brew "graphviz"
brew "grep"
brew "helm"
brew "highlight"
brew "htop"
brew "hub"
brew "icu4c@76"
brew "jabba"
brew "jq"
brew "k6"
brew "kind"
brew "kubernetes-cli"
brew "kops"
brew "kubectx"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "make"
brew "markdown"
brew "mas"
brew "maven"
brew "minikube"
brew "protobuf"
brew "mosh"
brew "mutt"
brew "navi"
brew "neovim"
brew "nmap"
brew "nnn"
brew "node"
brew "node@22"
brew "noti"
brew "nvm"
brew "pandoc"
brew "perl"
brew "pipenv"
brew "pkgconf"
brew "pnpm"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "rename"
brew "ripgrep"
brew "rocksdb"
brew "shellcheck"
brew "skaffold"
brew "stern"
brew "temporal"
brew "tesseract"
brew "the_silver_searcher"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "vim"
brew "watchman"
brew "wdiff"
brew "weechat"
brew "wget"
brew "wtf"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "antoniorodr/memo/memo"
brew "steipete/tap/gifgrep"
brew "steipete/tap/goplaces"
brew "steipete/tap/remindctl"
brew "steipete/tap/summarize"
brew "teamookla/speedtest/speedtest"
cask "basictex"
cask "font-3270-nerd-font"
cask "font-cascadia-mono"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "grammarly"
cask "grammarly-desktop"
cask "iterm2"
cask "little-snitch"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-teams"
cask "microsoft-word"
cask "openclaw"
cask "oracle-jdk@25"
cask "raycast"
cask "slack"
cask "sublime-merge"
cask "sublime-text"
cask "visual-studio-code"
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "CARROTweather", id: 993487541
mas "Dark Reader for Safari", id: 1438243180
mas "Final Cut Pro", id: 424389933
mas "PDF Expert", id: 1055273043
mas "WeChat", id: 836500024
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mermaidchart.vscode-mermaid-chart"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "oracle.oracle-java"
vscode "orta.vscode-jest"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "tomoki1207.pdf"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-lombok"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "yzhang.markdown-all-in-one"
