# taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "schniz/tap"

# packages
brew "ack"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "entr"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "grep"
brew "highlight"
brew "htop"
brew "hub"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "mas"
brew "nmap"
brew "noti"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "schniz/tap/fnm"
brew "shellcheck"
brew "the_silver_searcher"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "youtube-dl"
brew "z"
brew "zsh"

# Applications
cask "notion"
cask "istat-menus"
cask "paw"

# Browsers
cask "google-chrome"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-cascadia-mono"
cask "font-3270-nerd-font"

# macOS App Store
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Xcode", id: 497799835
mas "Reeder", id: 1449412482
mas "Magnet", id: 441258766
mas "Octotree Pro", id: 1457450145
